export const questions = {
  React: [
    {
      title: "React - это ... ?",
      variants: ["библиотека", "фреймворк", "приложение"],
      correct: 0,
    },
    {
      title: "Компонент - это ... ",
      variants: ["приложение", "часть приложения или страницы", "то, что я не знаю что такое"],
      correct: 1,
    },
    {
      title: "Что такое JSX?",
      variants: ["Это простой HTML", "Это функция", "Это тот же HTML, но с возможностью выполнять JS-код"],
      correct: 2,
    },
  ],
  Исскуство: [
    {
      title: "Кто из этих известных композиторов был глухим?",
      variants: ["Бетховен ", "Моцарт ", "Бах ", "Гендель"],
      correct: 0,
    },
    {
      title: "Граффити происходит от итальянского слова «граффиато», что означает что?",
      variants: ["Настенные рисунки", "Царапины", "Вандализм"],
      correct: 1,
    },
    {
      title: "В каком классическом фильме есть такая цитата: «Честно говоря, моя дорогая, мне наплевать»?",
      variants: ["Доктор Живаго", "Касабланка", "Гражданин Кейн", "Унесенные ветром"],
      correct: 3,
    },
    {
      title: "В какой деревне на Лонг-Айленде живет Джей Гэтсби в фильме «Великий Гэтсби»?",
      variants: ["Саутгемптон", "Ист-Виллидж", "Западное яйцо", "Нортвелл"],
      correct: 2,
    },
    {
      title: "В каком городе вы можете найти «Давида» Микеланджело?",
      variants: ["Флоренция", "Париж", "Тулуза", "Мадрид"],
      correct: 0,
    },
    {
      title: "Кто был главным архитектором Эйфелевой башни?",
      variants: ["Фрэнк Ллойд Райт", "Виктор Хора", "Людвиг Мис ван дер Роэ", "Стивен Совестр"],
      correct: 3,
    },
    {
      title: "В каком знаменитом балете представлены герои принца Зигфрида, Одетты и Одиллии?",
      variants: ["Лебединое озеро", "Щелкунчик", "Циндарелла", "Дон Кихот"],
      correct: 0,
    },
  ],
  Космос: [
    {
      title: "Сколько времени нужно, чтобы солнечный свет достиг Земли? ",
      variants: ["8 секунд", "8 минут", "8 часов", "8 дней"],
      correct: 1,
    },
    {
      title: "Какое созвездие ближе всего к Земле?",
      variants: ["Геркулес", "Центавр", "Орион", "Большая Медведица"],
      correct: 1,
    },
    {
      title: "Кто был первым человеком, который полетел в космос в 1961 году?",
      variants: ["Юрий Романенко", "Юрий Гласков", "Юрий Малышев ", "Юрий Гагарин"],
      correct: 3,
    },
    {
      title: "Как называется граница вокруг черной дыры, где свет не может избежать гравитационного притяжения дыры? ",
      variants: ["Горизонт событий", "Сингулярность", "Аккреционный диск", "Фотонное кольцо"],
      correct: 0,
    },
    {
      title: "Как называется галактика, ближайшая к Млечному Пути?",
      variants: ["Водоворот", "Головастик", "Андромеда", "Мессье 83"],
      correct: 2,
    },
    {
      title: "Как называется «космический бублик» из льда и камня, расположенный недалеко от орбиты Нептуна? ",
      variants: ["Облако Оорта ", "Стена Квавара", "Пояс Койпера", "Туманность Тор"],
      correct: 2,
    },
    {
      title: "Какая туманность ближе всего к Земле?",
      variants: ["Орион", "Краб ", "Конская голова", "Кошачий глаз"],
      correct: 0,
    },
  ],
  Фильмы: [
    {
      title: `В каком фильме есть эта цитата? "Лови момент. Ловите день, мальчики. Сделайте свою жизнь необычной"`,
      variants: ["Хорошая будет охота", "Общество мертвых поэтов", "Выходной Ферриса Бьюллера", "Клуб завтрака"],
      correct: 1,
    },
    {
      title: "В каком фильме 1993 года во Второй мировой войне снимались Лиам Нисон и Рэйф Файнс?",
      variants: ["Английский пациент", "Пианист ", "Список Шиндлера", "Читатель "],
      correct: 2,
    },
    {
      title: "Какой голливудский режиссер дебютировал в фильме «Дуэль» в 1971 году?",
      variants: ["Джордж Лукас", "Мартин Скорсезе", "Стивен Спилберг ", "Вуди Аллен"],
      correct: 2,
    },
    {
      title:
        "Какая драма о совершеннолетии, действие которой происходит во время Гражданской войны в США, была экранизацией книги Луизы М. Олкотт?",
      variants: ["Маленькие человечки", "Старомодная девочка", "Восемь кузенов ", "Маленькая женщина"],
      correct: 3,
    },
    {
      title:
        "Какая французская актриса сыграла вместе с Томом Хэнксом в роли агента Софи Невё в фильме 2006 года «Код да Винчи»? ",
      variants: ["Мелани Лоран", "Одри Тоту", "Марион Котийяр", "Ева Грин"],
      correct: 1,
    },
    {
      title: "В каком фильме снимались Харрисон Форд, Шон Янг и Рутгер Хауэр?",
      variants: ["Blade Runner", "В поисках утраченного ковчега", "Беглец ", "Звездные войны: Эпизод IV - Новая надежда"],
      correct: 0,
    },
  ],
  "Еда мира": [
    {
      title: "Откуда Том Ям?",
      variants: ["Шри-Ланка", "Таиланд ", "Япония", "Сингапур"],
      correct: 1,
    },
    {
      title: "Откуда появился бирьяни?",
      variants: ["Эфиопия", "Иордания", "Израиль", "Индия"],
      correct: 3,
    },
    {
      title: "Откуда хачапури?",
      variants: ["Албания ", "Кипр ", "Грузия", "Казахстан"],
      correct: 2,
    },
    {
      title: "В какой стране появился таджин?",
      variants: ["Марокко ", "Испания ", "Мексика ", "Саудовская Аравия"],
      correct: 0,
    },
  ],
  "Звездные войны": [
    {
      title: "Какой актер единственный появляется в каждом фильме по «Звездным войнам», кроме «Соло: История звездных войн»?",
      variants: ["Кэрри Фишер", "Марк Хэмилл", "Энтони Дэниелс ", "Уорвик Дэвис"],
      correct: 2,
    },
    {
      title: "Какого цвета световые мечи ситхов?",
      variants: ["Красный", "Синий ", "Фиолетовый", "Зеленый"],
      correct: 0,
    },
    {
      title:
        "В каком фильме из «Звездных войн» есть такая цитата: «Всегда помни, твоя направленность определяет твою реальность»?",
      variants: ["Империя наносит ответный удар ", "Скрытая угроза ", "Пробуждение силы", "Соло: История Звездных войн"],
      correct: 1,
    },
    {
      title: "Какой штурмовик не смог выполнить свою миссию в «Пробуждении силы»?",
      variants: ["ФН-1205 ", "ФН-1312 ", "FN-2187 ", "ФН-2705"],
      correct: 2,
    },
    {
      title: "Кто из джедаев ненавидит песок, любит Падме и слишком стар, чтобы тренироваться?",
      variants: ["Анакин Скайуокер ", "Мейс Винду ", "Куай-Гон Джинн ", "Люк Скайуокер"],
      correct: 0,
    },
    {
      title: "У какого персонажа повреждена маска Дарта Вейдера в «Пробуждении силы»?",
      variants: ["Финн ", "Рей  ", "Kylo Ren ", "Люк Скайуокер"],
      correct: 2,
    },
    {
      title: "Как принцесса Лея получила королевский титул?",
      variants: [
        "Издевательское прозвище от Хана Соло",
        "Она приемная дочь Бейла Органы и королевы Брехи ",
        "Ее острый прицел из бластера ",
        "Она дочь королевы джеонозианцев Катрины",
      ],
      correct: 1,
    },
    {
      title: "В каком фильме из «Звездных войн» есть такая цитата: «Теперь они летают?»",
      variants: [
        "Звездные войны: атака клонов",
        "Разбойник One: Star Wars история ",
        "Звездные войны: Восхождение Скайуокера ",
        "Соло: история звездных войн",
      ],
      correct: 2,
    },
    {
      title: "В каком транспортном средстве жила Рей?",
      variants: ["AT-ST", "Звездный разрушитель", "Мон-Калимари", "АТ-АТ"],
      correct: 3,
    },
  ],
  Marvel: [
    {
      title: `Кто помог найти Контроллер Яка Стрелы Йонду, когда он был в плену в "Стражах Галактики 2"?`,
      variants: ["Шри-Звездный Лорд", "Дракс Разрушитель", "Ракетный енот", "Groot"],
      correct: 3,
    },
    {
      title: "Какую еду Мстители идут есть после битвы за Нью-Йорк в первом фильме о Мстителях по предложению Тони Старка?",
      variants: ["Шаурма ", "Бургеры ", "Стейк ", "Мороженое"],
      correct: 0,
    },
    {
      title: "Что делала Джанет ван Дайн / Оса, когда сжалась в квантовом мире?",
      variants: [
        "Испытание пределов своего термоусадочного костюма",
        "Попытка обезвредить ядерную ракету",
        "Попытка проникнуть в штаб-квартиру ГИДРЫ",
        "Неисправность в ее уменьшающемся костюме",
      ],
      correct: 1,
    },
    {
      title: "Какое настоящее имя Соколиного Глаза?",
      variants: ["Барт Клинтон", "Коул Филсон ", "Клинт Бартон ", "Фил Коулсон"],
      correct: 2,
    },
    {
      title: "Кто является первоначальным владельцем Камня реальности?",
      variants: ["Асгардианцы", "Темные эльфы", "Люди  ", "Коллекционер"],
      correct: 1,
    },
    {
      title: `"Что означает буква "S" в SHIELD?"`,
      variants: ["Стратегический", "Высший ", "Особый", "Государственный"],
      correct: 0,
    },
    {
      title: "Какова последняя фраза Наташи перед тем, как она пожертвует собой на Вормире?",
      variants: ["Отпусти меня ", "Все нормально ", "«Клинт»", "Скажи всем, я…"],
      correct: 1,
    },
  ],
  Флаги: [
    {
      title: "Какого цвета звезды на флаге Новой Зеландии?",
      variants: ["Белый", "Красный", "Синий ", "Желтый"],
      correct: 1,
    },
    {
      title: "В центре какого флага изображено 24-спицевое колесо Ашока Чахра?",
      variants: ["Индия ", "Шри-Ланка", "Бангладеш", "Пакистан"],
      correct: 0,
    },
    {
      title: "Флаг какой страны содержит самую большую звезду из всех флагов мира?",
      variants: ["Центральноафриканская Республика", "Суринам", "Мьянма ", "Йемен"],
      correct: 2,
    },
    {
      title: "Какой из этих флагов НЕ содержит полумесяца и звезды?",
      variants: ["Пакистан  ", "Тунис  ", "Марокко  ", "Турция"],
      correct: 2,
    },
    {
      title: "На флаге России красный, белый и какой другой цвет?",
      variants: ["Синии  ", "Зеленый  ", "Черный  ", "Оранжевый"],
      correct: 0,
    },
    {
      title: "На каком флаге находится темно-синий кружок в центре с надписью 'ordem e progresso'?",
      variants: ["Португалия  ", "Кабо-Верде ", "Бразилия  ", "Суринам"],
      correct: 2,
    },
  ],
};
